# StructuralAttachmentEndRefelementEnd Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAttachmentEndRefelementEnd Property
ParameterTypeId Class See Also
---
"End of Attachment to Reference Element"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAttachmentEndRefelementEnd { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAttachmentEndRefelementEnd As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAttachmentEndRefelementEnd {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace